tutorials/incompressibleVoF/waterChannel/system/extrudeMeshDict.2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom mesh;
sourceCase "$FOAM_CASE";
sourcePatches (outlet);

flipNormals false;

extrudeModel
{
    type            linearDirection;

    nLayers         40;
    expansionRatio  1.0;

    axisPt          (0 0 0);
    direction       (1 -0.2 -0.03);
    thickness       40;
}

mergeFaces false;

// ************************************************************************* //
